###
# cli
###

brew 'ansible'
brew 'asdf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'ctop'
brew 'curl'
brew 'docker'
brew 'elixir'
brew 'fd'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-extras'
brew 'gnu-sed'
brew 'gnuplot'
brew 'go'
brew 'gpg'
brew 'graphviz'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'mas'
brew 'n'
brew 'neovim'
brew 'postgresql'
brew 'pv'
brew 'rabbitmq'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rustup'
brew 'swift'
brew 'swiftformat'
brew 'terraform'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'vowpal-wabbit'
brew 'wget'
brew 'xsv'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zsh'

tap 'derailed/k9s'
brew 'k9s'

tap 'getantibody/tap'
brew 'antibody'

tap 'golangci/tap'
brew 'golangci-lint'

###
# gui
###

mas 'Bear', id: 1091189122
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835

tap 'homebrew/cask'
cask 'alacritty'
cask 'charles'
cask 'docker'
cask 'expressvpn'
cask 'figma'
cask 'gas-mask'
cask 'google-backup-and-sync'
cask 'hammerspoon'
cask 'hex-fiend'
cask 'kap'
cask 'karabiner-elements'
cask 'keybase'
cask 'kitematic'
cask 'minikube'
cask 'minikube'
cask 'ngrok'
cask 'postico'
cask 'postman'
cask 'slack'
cask 'telegram'
cask 'transmission'
cask 'virtualbox' # minikube
cask 'visual-studio-code'
cask 'vlc'

tap 'homebrew/cask-fonts'
cask 'font-firacode-nerd-font'

tap 'homebrew/cask-versions'
cask 'firefox-beta'
