###
# cli
###

brew 'ansible'
brew 'asdf'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'ctop'
brew 'curl'
brew 'docker'
brew 'fd'
brew 'fish'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'gnu-sed'
brew 'gnuplot'
brew 'go'
brew 'gpg'
brew 'graphviz'
brew 'htop'
brew 'httpstat'
brew 'hub'
brew 'inetutils'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lynx'
brew 'mas'
brew 'minidlna'
brew 'minikube'
brew 'n'
brew 'neovim'
brew 'newsboat'
brew 'nmap'
brew 'openssl'
brew 'packer'
brew 'postgresql'
brew 'pup'
brew 'pv'
brew 'rabbitmq'
brew 'redis'
brew 'ripgrep'
brew 'rustup'
brew 'swift'
brew 'swiftformat'
brew 'terraform'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'vowpal-wabbit'
brew 'watchexec'
brew 'wget'
brew 'wrk'
brew 'xsv'
brew 'xz'
brew 'yarn'
brew 'z'
brew 'zsh'

tap 'browsh-org/homebrew-browsh'
brew 'browsh'

tap 'derailed/k9s'
brew 'k9s'

tap 'getantibody/tap'
brew 'antibody'

tap 'golangci/tap'
brew 'golangci-lint'

tap 'weaveworks/tap'
brew 'eksctl'

###
# gui
###

mas 'Bear', id: 1091189122
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835

tap 'homebrew/cask'
cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'caprine'
cask 'charles'
cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
cask 'docker'
cask 'gas-mask'
cask 'google-backup-and-sync'
cask 'hammerspoon'
cask 'hex-fiend'
cask 'istat-menus'
cask 'kap'
cask 'karabiner-elements'
cask 'keybase'
cask 'ngrok'
#cask 'plash'
cask 'postico'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'virtualbox' # minikube
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

tap 'homebrew/cask-fonts'
cask 'font-firacode-nerd-font'

tap 'homebrew/cask-versions'
cask 'firefox-beta'
