# Taps
tap 'aymericbeaumet/tap'
tap 'domcyrus/rustnet'
tap 'oven-sh/bun'
tap 'PeonPing/tap'
tap 'schpet/tap'
tap 'stripe/stripe-cli'
tap 'tw93/tap'

# Brews
brew 'awscli'
brew 'aymericbeaumet/tap/squeeze-nightly'
brew 'bat'
brew 'btop'
brew 'oven-sh/bun/bun'
brew 'carapace'
brew 'ccusage'
brew 'cmake'
brew 'coreutils'
brew 'csvlens'
brew 'docker' # cli only
brew 'domcyrus/rustnet/rustnet'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-lfs'
brew 'glow'
brew 'gnupg'
brew 'gradle'
brew 'graphviz'
brew 'htop'
brew 'hyperfine'
brew 'inetutils'
brew 'iredis'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'libpq'
brew 'mise'
brew 'neovim'
brew 'nmap'
brew 'nvtop'
brew 'parallel'
brew 'PeonPing/tap/peon-ping'
brew 'procs'
brew 'railway'
brew 'rename'
brew 'ripgrep'
brew 'rtk'
brew 'rustup'
brew 'schpet/tap/linear'
brew 'sd'
brew 'stripe/stripe-cli/stripe'
brew 'tealdeer'
brew 'tmux'
brew 'tmuxinator'
brew 'tokei'
brew 'tw93/tap/mole'
brew 'vercel-cli'
brew 'watchexec'
brew 'websocat'
brew 'wget'
brew 'wireguard-tools'
brew 'wthrr'
brew 'yazi'
brew 'zoxide'
brew 'zsh'

# Casks
cask 'alacritty'
cask 'antigravity-cli'
cask 'aws-vpn-client'
cask 'claude'
cask 'claude-code'
cask 'codex'
cask 'cursor'
cask 'db-browser-for-sqlite'
cask 'figma'
cask 'firefox'
cask 'font-fira-code-nerd-font'
cask 'google-drive'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'linear'
cask 'logitech-g-hub'
cask 'notion'
cask 'postico'
cask 'postman'
cask 'protonvpn'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'utm'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
